# Loading the needed libraries.

It's is indeed useful skill to organize your notebooks folowwing some structue, so futher when you will operate with a bunch of code lines you will have lower probability to mess it up

In [107]:
import pandas as pd
import numpy as np
pd.__version__

'0.24.2'

# Pandas

At the very basic level, Pandas objects can be thought of as enhanced versions of
NumPy structured arrays in which the rows and columns are identified with labels
rather than simple integer indices.

A Pandas Series is a one-dimensional array of indexed data. It can be created from a list or array.

As you will practice with Pandas package, you will need to use 'Social_network_adds.csv' file.

#### Task #1.1 Create a Series object from random NumPy array

In [30]:
# Your code goes here, don't run the cell with answer.
#1___
#pand = pd.Series(np.linspace(1, 1, 9)) 
#print(pand) 

#2___
#d = np.array([1.0])    
#pand = pd.Series(d) 
#print(pand) 

#3___
pand = pd.Series(np.repeat(1.0, 9)) 
print(pand)

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
6    1.0
7    1.0
8    1.0
dtype: float64

In [25]:
#Ouptup - Don't run this cell!

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
6    1.0
7    1.0
8    1.0
dtype: float64

#### Task #1.2 Create a Series object with specific indecies - aka dictionary

In [31]:
# Your code goes here, don't run the cell with answer below.
#1___

d = np.array([95, 90, 85, 80, 75, 70]) 
pand = pd.Series(d, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
print(pand)

A     95
A-    90
B+    85
B     80
B-    75
C+    70
dtype: int32

In [33]:
#Ouptup - Don't run this cell!

A     95
A-    90
B+    85
B     80
B-    75
C+    70
dtype: int32

Print specific element of Series

In [36]:
# Your code goes here, don't run the cell with answer below.
d = np.array([95, 90, 85, 80, 75, 70]) 
pand = pd.Series(d, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
print(pand[3])

80

In [35]:
#Ouptup - Don't run this cell!

80

Print all indices of Series

In [44]:
# Your code goes here, don't run the cell with answer below.
#1___
#d = np.array([95, 90, 85, 80, 75, 70]) 
#pand = pd.Series(d, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
#print(pand.index)

#2___
d = np.array([95, 90, 85, 80, 75, 70]) 
pand = pd.Series(d, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
print(pand.keys())

Index(['A', 'A-', 'B+', 'B', 'B-', 'C+'], dtype='object')

In [36]:
#Ouptup - Don't run this cell!

Index(['A', 'A-', 'B+', 'B', 'B-', 'C+'], dtype='object')

Print all key-values

In [87]:
# Your code goes here, don't run the cell with answer below.
#1___
#This method was written just4fun

#d = np.array([95, 90, 85, 80, 75, 70]) 
#pand = pd.Series(d, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
#l1 = list(pand.values)
#l2 = list(pand.keys())
#l3 = dict(zip(l2, l1))
#print (str(l3).replace(":", ","))

#2___
d = np.array([95, 90, 85, 80, 75, 70]) 
pand = pd.Series(d, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
l1 = list(pand.index.to_numpy()) 
l2 = list (pand.to_numpy())
res = list(zip(l1, l2))
print(res)

[('A', 95), ('A-', 90), ('B+', 85), ('B', 80), ('B-', 75), ('C+', 70)]

In [40]:
#Ouptup - Don't run this cell!

[('A', 95), ('A-', 90), ('B+', 85), ('B', 80), ('B-', 75), ('C+', 70)]

Print the following slice of Series

In [88]:
# Your code goes here, don't run the cell with answer below.
d = np.array([95, 90, 85, 80, 75, 70]) 
pand = pd.Series(data, index =['A', 'A-', 'B+', 'B', 'B-', 'C+']) 
print(pand[:3])

A     95
A-    90
B+    85
dtype: int32

In [44]:
#Ouptup - Don't run this cell!

A     95
A-    90
B+    85
dtype: int32

#### Task #1.3 Create a Series from string object str = "AB BC CD DE EF" with indecies [1,3,5,7,9]

In [103]:
str = "AB BC CD DE EF"
d = np.array(str.split())
pand = pd.Series(d, (1,3,5,7,9)) 
print(pand)

1    AB
3    BC
5    CD
7    DE
9    EF
dtype: object

In [53]:
#Ouptup - Don't run this cell!

1    AB
3    BC
5    CD
7    DE
9    EF
dtype: object

Print [2..4] elements using indexing, don't use dictionary-style indexing

In [105]:
# Your code goes here, don't run the cell with answer below.
str = "AB BC CD DE EF"
d = np.array(str.split())
pand = pd.Series(d, (1,3,5,7,9)) 
print(pand[1:4])

3    BC
5    CD
7    DE
dtype: object

In [54]:
#Ouptup - Don't run this cell!

3    BC
5    CD
7    DE
dtype: object

#### Task #2. Create a dataframe and upload your data from given .csv file

Recall that a DataFrame acts in many ways like a two-dimensional or structured array, and in other ways like a dictionary of Series structures sharing the same index.

Print first 7 entries of dataframe

In [116]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
db_read.head(7)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0

In [141]:
#Ouptup - Don't run this cell!

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0

Print main statistical descriptions of dataframe

In [117]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
db_read.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [68]:
#Ouptup - Don't run this cell!

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

Check out how many entities are in dataframe

In [120]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
db_read.shape

(400, 5)

In [134]:
#Ouptup - Don't run this cell!

(400, 5)

Check if there any missing data in dataframe

In [124]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
db_read.isnull().values.any()

False

In [74]:
#Ouptup - Don't run this cell!

False

Check how many unique User ID are in dataset

In [125]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
db_read['User ID'].nunique()

400

In [80]:
#Ouptup - Don't run this cell!

400

#### Task #3. Manipulating data in dataframe

Create a dataframe containing only those Users who has purchaised anything, print first 10 entries
Name your dataframe as users_purch_1

In [138]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
users_purch_1 = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
users_purch_1.loc[users_purch_1['Purchased'] == 1].head(10)

     User ID  Gender  Age  EstimatedSalary  Purchased
7   15694829  Female   32           150000          1
16  15733883    Male   47            25000          1
17  15617482    Male   45            26000          1
18  15704583    Male   46            28000          1
19  15621083  Female   48            29000          1
20  15649487    Male   45            22000          1
21  15736760  Female   47            49000          1
22  15714658    Male   48            41000          1
23  15599081  Female   45            22000          1
24  15705113    Male   46            23000          1

In [89]:
#Ouptup - Don't run this cell!

     User ID  Gender  Age  EstimatedSalary  Purchased
7   15694829  Female   32           150000          1
16  15733883    Male   47            25000          1
17  15617482    Male   45            26000          1
18  15704583    Male   46            28000          1
19  15621083  Female   48            29000          1
20  15649487    Male   45            22000          1
21  15736760  Female   47            49000          1
22  15714658    Male   48            41000          1
23  15599081  Female   45            22000          1
24  15705113    Male   46            23000          1

Print number of men and women who purchased anything

In [170]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
users_purch_1 = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')

dd = users_purch_1.loc[users_purch_1['Purchased'] == 1]

dd["Gender"].value_counts()

Female    77
Male      66
Name: Gender, dtype: int64

In [94]:
#Ouptup - Don't run this cell!

Gender
Female    77
Male      66
Name: User ID, dtype: int64

Compare averages of EstimatedSalary of Users who has purchased and who hasn't

In [166]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
users_purch_1 = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')

d_purchased = users_purch_1.loc[users_purch_1['Purchased'] == 1]["EstimatedSalary"].mean()
d_NOTpurchased = users_purch_1.loc[users_purch_1['Purchased'] == 0]["EstimatedSalary"].mean()

print((d_purchased, d_NOTpurchased))

(86272.72727272728, 60544.74708171206)

In [111]:
#Ouptup - Don't run this cell!

(86272.72727272728, 60544.74708171206)

Create a new colum -"AVR_" in users_purch_1 as a result of substraction of Average Salary and Salary column

In [210]:
# Your code goes here, don't run the cell with answer below. Note that you can obtain different numbers
users_purch_1 = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
users_purch_1 = users_purch_1.loc[users_purch_1['Purchased'] == 1]

averageSalary = users_purch_1["EstimatedSalary"].mean()

users_purch_1['AVR_'] = averageSalary
users_purch_1['AVR_'] = users_purch_1['EstimatedSalary'] - users_purch_1['AVR_'] 
users_purch_1.head()

     User ID  Gender  Age  EstimatedSalary  Purchased          AVR_
7   15694829  Female   32           150000          1  63727.272727
16  15733883    Male   47            25000          1 -61272.727273
17  15617482    Male   45            26000          1 -60272.727273
18  15704583    Male   46            28000          1 -58272.727273
19  15621083  Female   48            29000          1 -57272.727273

In [116]:
#Ouptup - Don't run this cell!

     User ID  Gender  Age  EstimatedSalary  Purchased          AVR_
7   15694829  Female   32           150000          1  63727.272727
16  15733883    Male   47            25000          1 -61272.727273
17  15617482    Male   45            26000          1 -60272.727273
18  15704583    Male   46            28000          1 -58272.727273
19  15621083  Female   48            29000          1 -57272.727273

#### Task #4. Divide data into 2 sets

Now we are working with full dataset again.
First, you need to save 30% of data as delayed_data

In [284]:
# Your code goes here, don't run the cell with answer below. 
db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
ll = list(db_read.shape)

size_1 = int(ll[0]*0.3) -1
delayed_data = db_read.loc[0:size_1, :]

size_2 = int(ll[0]) +1
last_data = db_read.loc[size_1+1:size_2, :]

(delayed_data.shape, last_data.shape)

((120, 5), (280, 5))

In [142]:
#Ouptup - Don't run this cell!

((120, 5), (280, 5))

Now join two dataframes again, even if this task seems weird - it was done to warm up and recall your previous knowledge. Merging 2 dataframes are pretty common operation.

In [286]:
# Your code goes here, don't run the cell with answer below. 

db_read = pd.read_csv('Social_Network_Ads.csv', delimiter = ',')
ll = list(db_read.shape)

size_1 = int(ll[0]*0.3) -1
delayed_data = db_read.loc[0:size_1, :]

size_2 = int(ll[0]) + 1
last_data = db_read.loc[size_1+1 : size_2, :]
#till this row was code from previos task

new_data = delayed_data + last_data
new_data.shape

(400, 5)

In [144]:
#Ouptup - Don't run this cell!

(400, 5)

### Congratulations, you have completed practice with Pandas. However, its never too much to practice, especially with Pandas package.